# vim: filetype=ruby

# Casks (GUI apps)

## General crossplatform
cask "1password"                # 1piece
cask "1password-cli"            # 1piece
cask "brave-browser"            # Browser of choice
cask "cyberduck"                # GUI FTP client
cask "discord"                  # Chat app
cask "flameshot"                # Screen shot tool
cask "kitty"                    # Terminal emulator
cask "obsidian"                 # Notes system
cask "private-internet-access"  # VPN
cask "visual-studio-code"       # Thicc editor, light IDE

## Keyboard-centric workflow related
cask "karabiner-elements"          # Keyboard manipulation/remapping
cask "raycast"                     # Launcher
brew "FelixKratz/formulae/borders" # JankyBorders
# DWM-like tiling window manager
tap "hillyu/tap"
cask "dwmac"

# Non-cask packages

## Apple-specific:
brew "fastlane"            # Build tool for Apple platform apps
brew "swiftformat"         # Formatter for Swift
brew "swiftlint"           # Linter for Swift
brew "xcbeautify"          # Beautifier for XCode things
brew "xcode-build-server"  # Do Xcode things outside of Xcode
brew "xcodegen"            # Xcode projects using dir structure and project spec
